<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1034]:
import pandas as pd
import psycopg2

In [1035]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [1036]:


connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

n = 10
query = f'''select *
           from 
                vacancies
           limit {n}
        '''

df = pd.read_sql_query(query, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1672308879.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
5,55906072,Корректор,Корректура текстов\tГрамотность\tРабота в кома...,Полный день,Нет опыта,Полная занятость,NaN,NaN,2323,584934
6,55523207,React Front-end Middle Developer,JavaScript\tTypeScript\tCSS3\tNode.js\tHTML5,Гибкий график,От 1 года до 3 лет,Полная занятость,NaN,NaN,2759,204511
7,55050261,Инженер-программист,Java SE\tSpring Framework\tSpring Boot\tGit\tS...,Полный день,Нет опыта,Полная занятость,40000.0,60000.0,49,4448636
8,55583432,Системный администратор,Linux\tАдминистрирование сетевого оборудования...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,NaN,3,55126
9,55312414,Ведущий специалист группы разработки систем,1С программирование\t1С: Предприятие 8\t1С: До...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,47,1413754

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [1037]:
# текст запроса
query_3_1 = f'''
           select
                count(id)
           from 
                vacancies
'''

In [1038]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [1039]:
# текст запроса
query_3_2 = f'''
           select
                count(distinct id)
           from 
                employers
'''

In [1040]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [1041]:
# текст запроса
query_3_3 = f'''
           select
                count(distinct id)
           from 
                areas
'''

In [1042]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [1043]:
# текст запроса
query_3_4 = f'''
           select
                count(distinct id)
           from 
                industries
'''

In [1044]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [1045]:
# выводы по предварительному анализу данных
'''
У 23501 работодателя находящихся в 1362 регионах и ведущих дела в 294 отрослях бизнеса имеется 49197 вакансий.
'''

'\nУ 23501 работодателя находящихся в 1362 регионах и ведущих дела в 294 отрослях бизнеса имеется 49197 вакансий.\n'

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [1046]:
# текст запроса
query_4_1 = f'''
    select
        count(v.id) cnt,
        a.name area
    from 
        vacancies v
        join areas a on a.id = v.area_id
    group by a.name
    order by 1 desc
'''

In [1047]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

      cnt             area
0    5333           Москва
1    2851  Санкт-Петербург
2    2112            Минск
3    2006      Новосибирск
4    1892           Алматы
..    ...              ...
764     1       Тарко-Сале
765     1    Новоаннинский
766     1            Бирск
767     1           Сасово
768     1             Анна

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [1048]:
# текст запроса
q_4_2 = f'''
    select
      salary_from,
      salary_to
    from 
      vacancies
    where salary_from is not null or salary_to is not null
'''

In [1049]:
# результат запроса
df = pd.read_sql_query(q_4_2, connection)
print('количество вакансий у которых заполнено хотя бы одно из двух полей -', df.shape[0])

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2680735510.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_4_2, connection)

количество вакансий у которых заполнено хотя бы одно из двух полей - 24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [1050]:
# текст запроса
q_4_3 = f'''
    select
      avg(salary_from),
      avg(salary_to)
    from 
      vacancies
    where salary_from is not null or salary_to is not null
'''

In [1051]:
# результат запроса
df = pd.read_sql_query(q_4_3, connection)
print(f'среднее значение нижней границы зарплатной вилки - {round(df.iloc[0, 0])}\nсреднее значение верхней граница зарплатной вилки - {round(df.iloc[0, 1])}')

среднее значение нижней границы зарплатной вилки - 71065
среднее значение верхней граница зарплатной вилки - 110537

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2306365323.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_4_3, connection)

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [1052]:
# текст запроса
q_4_4 = f'''
    select distinct
      schedule,
      employment,
      count(name)
    from 
      vacancies
    group by 1, 2
    order by 3 desc
'''

In [1053]:
# результат запроса
df = pd.read_sql_query(q_4_4, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/3947170584.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [1054]:
# текст запроса
q_4_5 = f'''
    select distinct
      experience,
      count(id)
    from 
      vacancies
    group by 1
    order by 2 asc
'''

In [1055]:
# результат запроса
df = pd.read_sql_query(q_4_5, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1380712391.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [1056]:
# выводы по детальному анализу вакансий
'''
Подавляющее большинство вакансий требуется в Москве. Примерно в половине случаев границы вознаграждения не указываются, надо думать, они будут определяться 
при  рассмотрении конкретного претендента. Работодатели предпочитают режим работы в виде полной занятости при полном дне. 
Большинство работодателей вполне удовлетворяет опыт работы кандидатов от 1 года до 3 лет 
'''

'\nПодавляющее большинство вакансий требуется в Москве. Примерно в половине случаев границы вознаграждения не указываются, надо думать, они будут определяться \nпри  рассмотрении конкретного претендента. Работодатели предпочитают режим работы в виде полной занятости при полном дне. \nБольшинство работодателей вполне удовлетворяет опыт работы кандидатов от 1 года до 3 лет \n'

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [1057]:
# текст запроса
q_5_1 = f'''
    select distinct
        e.name,
        count(v.name)
    from 
        vacancies v
        join employers e on e.id = v.employer_id
    group by 1
    order by 2 desc
    limit 1
'''

q_5_1_ = f'''
    select distinct
        e.name,
        count(v.name)
    from 
        vacancies v
        join employers e on e.id = v.employer_id
    group by 1
    order by 2 desc
    limit 1 offset 4
'''

In [1058]:
# результат запроса
df = pd.read_sql_query(q_5_1, connection)
print(f'работодатель на первом по количеству вакансий месте: {df.iloc[0, 0]}, вакансий {df.iloc[0, 1]}')

df = pd.read_sql_query(q_5_1_, connection)
print(f'работодатель на пятом по количеству вакансий месте: {df.iloc[0, 0]}, вакансий {df.iloc[0, 1]}')

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1474862290.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_5_1, connection)
/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1474862290.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_5_1_, connection)

работодатель на первом по количеству вакансий месте: Яндекс, вакансий 1933
работодатель на пятом по количеству вакансий месте: Газпром нефть, вакансий 331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [1059]:
# текст запроса

q_5_2 = f'''
    select 
        a.name area,
        count( v.id) vac,
        count( e.id) employer
    from 
        areas a
        left join employers e on e.area = a.id
        left join vacancies v on v.area_id = a.id
    where v.area_id is null
    group by 1
    order by 3 desc
'''

In [1060]:
# результат запроса
df = pd.read_sql_query(q_5_2, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/3030419338.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_5_2, connection)

                             area  vac  employer
0                          Россия    0       410
1                       Казахстан    0       207
2              Московская область    0        75
3              Краснодарский край    0        19
4                        Беларусь    0        18
..                            ...  ...       ...
588                      Струнино    0         0
589    Славгород (Алтайский край)    0         0
590                     Сорочинск    0         0
591  Ленинский (Тульская область)    0         0
592                         Тавда    0         0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [1061]:
# текст запроса

q_5_3 = f'''
    select 
        e.name ,
        count(distinct v.area_id) vac
    from 
        employers e
        left join vacancies v on v.employer_id = e.id
        left join areas a on v.area_id = a.id
    group by 1
    order by 2 desc
'''

In [1062]:
# результат запроса
df = pd.read_sql_query(q_5_3, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/3019282801.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_5_3, connection)

                         name  vac
0                      Яндекс  181
1                  Ростелеком  152
2                  Спецремонт  116
3      Поляков Денис Иванович   88
4                   ООО ЕФИН    71
...                       ...  ...
23170                  СДЕЛКА    0
23171            Alandr Group    0
23172                     СДК    0
23173      Lemon Land Lombard    0
23174                  Махина    0

[23175 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [1063]:
# текст запроса

q_5_4 = f'''
        select
            count(e.id)
            
        from 
            employers e
            left join EMPLOYERS_INDUSTRIES i on e.id = i.employer_id
        where i.industry_id is null
'''

In [1064]:
# результат запроса
print(f'количество работодателей у которых не указана сфера деятельности - {pd.read_sql_query(q_5_4, connection).iloc[0,0]}')

количество работодателей у которых не указана сфера деятельности - 8419

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/111192015.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'количество работодателей у которых не указана сфера деятельности - {pd.read_sql_query(q_5_4, connection).iloc[0,0]}')

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [1065]:
# текст запроса

q_5_5 = f'''
    select
        distinct e.name,
        count(i.industry_id)
    from 
        employers e
        join EMPLOYERS_INDUSTRIES i on i.employer_id = e.id
    group by 1
    having count(i.industry_id) = 4
    order by 1
    limit 1 offset 2
'''

In [1066]:
# результат запроса
print(f'компания, находящаяся на третьем месте в списке компаний, у которых указано четыре сферы деятельности - {pd.read_sql_query(q_5_5, connection).iloc[0, 0]}')

компания, находящаяся на третьем месте в списке компаний, у которых указано четыре сферы деятельности - 2ГИС

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1802824639.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'компания, находящаяся на третьем месте в списке компаний, у которых указано четыре сферы деятельности - {pd.read_sql_query(q_5_5, connection).iloc[0, 0]}')

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [1067]:
# текст запроса

q_5_6 = f'''
    select
        count(distinct e.id)
    from 
        employers e
        join EMPLOYERS_INDUSTRIES ei on ei.employer_id = e.id
        join industries i on i.id = ei.industry_id
    where i.name = 'Разработка программного обеспечения'
'''

In [1068]:
# результат запроса
print(f'У {pd.read_sql_query(q_5_6, connection).iloc[0, 0]} работодателей в качестве сферы деятельности указана Разработка программного обеспечения')

У 3553 работодателей в качестве сферы деятельности указана Разработка программного обеспечения

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/741681399.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'У {pd.read_sql_query(q_5_6, connection).iloc[0, 0]} работодателей в качестве сферы деятельности указана Разработка программного обеспечения')

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8).

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [1069]:
# код для получения списка городов-милионников

from urllib.parse import quote_plus
url = quote_plus('https://ru.wikipedia.org/wiki/Города-миллионеры_России', safe=':/')
tables = pd.read_html(url)
cities = tuple(tables[0]['Город'])
# print(cities)

In [1070]:
# текст запроса
q_5_7 = f'''
    select
        a.name region, 
        count(v.id)
    from 
        employers e
        join vacancies v on v.employer_id = e.id
        join areas a on v.area_id = a.id
    where e.name = 'Яндекс' and a.name in {cities}
    group by a.name, e.name
    union 
    select
        'total' region,
        count(v.id)
    from 
        employers e
        join vacancies v on v.employer_id = e.id
        join areas a on v.area_id = a.id
    where e.name = 'Яндекс' and a.name in {cities}
    group by e.name
    order by 2 asc
'''

In [1071]:
# результат запроса
df = pd.read_sql_query(q_5_7, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/3401293759.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_5_7, connection)

             region  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            total    485

***

In [1072]:
# выводы по анализу работодателей
'''
Анализ работодателей позволил определить тех из них, кто нуждается в наибольшем числе работников, а также распределение вакансий по регионам. 
Косвенно, по количеству вакансий в том или ином регионе можно определить активность конкретного работодателя в этом регионе. Кроме того, можно предположить, что
в регионах где нет вакансий деловая активность работодателей в целом невысока. Обсуждаемый анализ помимо прочего даёт представление о сферах деятельности наиболее и наименее 
нуждающихся в кадрах и сделать вывод о развитии той или иной отрасли.
'''

'\nАнализ работодателей позволил определить тех из них, кто нуждается в наибольшем числе работников, а также распределение вакансий по регионам. \nКосвенно, по количеству вакансий в том или ином регионе можно определить активность конкретного работодателя в этом регионе. Кроме того, можно предположить, что\nв регионах где нет вакансий деловая активность работодателей в целом невысока. Обсуждаемый анализ помимо прочего даёт представление о сферах деятельности наиболее и наименее \nнуждающихся в кадрах и сделать вывод о развитии той или иной отрасли.\n'

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [1073]:
# текст запроса
q_6_1 = f'''
    select
        count(v.id)
    from 
        vacancies v
    where (lower(v.name) like '%data%') or (lower(v.name) like '%данн%')
    
'''

In [1074]:
# результат запроса
print(f'Вакансий, имеющих отношение к данным - {pd.read_sql_query(q_6_1, connection).iloc[0, 0]}')

Вакансий, имеющих отношение к данным - 1771

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/4152954377.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'Вакансий, имеющих отношение к данным - {pd.read_sql_query(q_6_1, connection).iloc[0, 0]}')

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста?
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [1075]:
# текст запроса
q_6_2 = f'''
    select
        count( id)
    from 
        vacancies v
    where (lower(name) like '%data scientist%' 
        or lower(name) like '%data science%' 
        or lower(name) like '%исследователь данных%'
        or ((name like '%ML%') and (name not like '%HTML%')) 
        or lower(name) like '%machine learning%' 
        or lower(name) like '%машинн%обучен%')
        and
        (lower(name) like '%junior%'
        or experience = 'Нет опыта' 
        or employment = 'Стажировка')
'''

In [1076]:
# результат запроса
print(f'вакансий для начинающего дата-сайентиста - {pd.read_sql_query(q_6_2, connection).iloc[0, 0]}')

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2825139740.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'вакансий для начинающего дата-сайентиста - {pd.read_sql_query(q_6_2, connection).iloc[0, 0]}')

вакансий для начинающего дата-сайентиста - 51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [1077]:
# текст запроса
q_6_3 = f'''SELECT 
               count(name) as n_vac
            FROM 
               vacancies
            WHERE (lower(name) LIKE '%data scientist%' 
                or lower(name) LIKE '%data science%' 
                or lower(name) LIKE '%исследователь данных%' 
                or lower(name) LIKE '%ml%' and name NOT LIKE '%HTML%' and name not like '%QML%' 
                or lower(name) LIKE '%machine learning%' 
                or lower(name) LIKE '%машинн%обучен%') 
                and(lower(key_skills) LIKE '%postgres%'
                or lower(key_skills) LIKE '%sql%')
             '''

In [1078]:
# результат запроса
print(f'вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres - {pd.read_sql_query(q_6_3, connection).iloc[0, 0]}')

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1257662247.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres - {pd.read_sql_query(q_6_3, connection).iloc[0, 0]}')

вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres - 229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [1079]:
# текст запроса
q_6_4 = f'''SELECT 
               count(name)
            FROM 
               vacancies
            WHERE (lower(name) LIKE '%data scientist%' 
                or lower(name) LIKE '%data science%' 
                or lower(name) LIKE '%исследователь данных%' 
                or lower(name) LIKE '%ml%' and vacancies.name NOT LIKE '%HTML%' and vacancies.name not like '%QML%' 
                or lower(name) LIKE '%machine learning%' 
                or lower(name) LIKE '%машинн%обучен%') 
                and lower(key_skills) LIKE '%python%'
             '''

In [1080]:
# результат запроса
print(f'количество вакансий, в которых в качестве ключевого навыка указан Python - {pd.read_sql_query(q_6_4, connection).iloc[0, 0]}')

количество вакансий, в которых в качестве ключевого навыка указан Python - 357

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/350873890.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'количество вакансий, в которых в качестве ключевого навыка указан Python - {pd.read_sql_query(q_6_4, connection).iloc[0, 0]}')

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [1081]:
# текст запроса
q_6_5 = f'''SELECT 
               round(avg(length(key_skills) - length(replace(key_skills, chr(9), '')) + 1), 2)
            FROM 
               vacancies
            WHERE (lower(name) LIKE '%data scientist%' 
                or lower(name) LIKE '%data science%' 
                or lower(name) LIKE '%исследователь данных%' 
                or (name LIKE '%ML%' and name NOT LIKE '%HTML%')
                or lower(name) LIKE '%machine learning%' 
                or lower(name) LIKE '%машинн%обучен%') 
                and key_skills is not null
             '''

In [1082]:
# результат запроса
print(f'ключевых навыков в среднем указывают в вакансиях для DS - {pd.read_sql_query(q_6_5, connection).iloc[0, 0]}')

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/983463848.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'ключевых навыков в среднем указывают в вакансиях для DS - {pd.read_sql_query(q_6_5, connection).iloc[0, 0]}')

ключевых навыков в среднем указывают в вакансиях для DS - 6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*).

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [1083]:
q_6_6 = f'''
SELECT
    experience,
    round(AVG(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) as result
FROM 
    vacancies 
WHERE 
    (salary_from IS not NULL or salary_to IS not NULL) and
    (name ilike '%data scientist%'
    or name ilike '%data science%'
    or name ilike '%исследователь данных%'
    or name ilike '%machine learning%'
    or name ilike '%машинн%обучен%'
    or (name not ilike '%HTML%' and name like '%ML%'))
GROUP BY 1
'''

In [1084]:
# результат запроса
print(f'дата-сайентист с опытом работы от 3 до 6 лет в среднем может рассчитывать на зарплату - {pd.read_sql_query(q_6_6, connection).iloc[2, 1]}')
df = pd.read_sql_query(q_6_6, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1797780120.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  print(f'дата-сайентист с опытом работы от 3 до 6 лет в среднем может рассчитывать на зарплату - {pd.read_sql_query(q_6_6, connection).iloc[2, 1]}')

дата-сайентист с опытом работы от 3 до 6 лет в среднем может рассчитывать на зарплату - 243115.0

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/1797780120.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q_6_6, connection)

           experience    result
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

In [1085]:
# выводы по предметному анализу
'''
Данный предметный анализ сконцентрирован лишь на исследовании вопросов относящихся к data science и как таковой, является достаточно узким. 
Всякого рода выводы из этого анализа носят локальный характер, освещающий лишь одну сферу деятельности и не могут быть распространены на прочие. 
Установлено, что количество вакансий касающихся data science составляет около 3 процентов от общего числа имеющихся вакансий. 
Однако само по себе это не говорит о дефиците или переизбытке трудовых ресурсов в сфере data science. При этом доступных 
для начинающих лишь 51 вакансия, что, несомненно крайне ограничивает их вхождение в этот сегмент трудового рынка.
Как выяснилось, для data scientists знание SQL или postgres не является сколько-нибудь определяющим поскольку присутствует лишь в 13% доступных
для data scientists вакансий. Для всех прочих вакансий эти навыки не являются ключевыми. 
Полученные результаты касательно владения Python как ключевым навыком показывают, что он востребован в качестве такового лишь 
в 20% имеющихся вакансий. 
Данные о среднем количестве ключевых навыков, будучи избыточными и безотносительными не применимы для понимания трудового рынка.
Анализ средней заработной платы в зависимости от опыта работы весьма полезен для нахождения баланса между желаемым и действительным и как
таковой имеет существенное практическое значение для всех сторон трудовых отношений.
'''

'\nДанный предметный анализ сконцентрирован лишь на исследовании вопросов относящихся к data science и как таковой, является достаточно узким. \nВсякого рода выводы из этого анализа носят локальный характер, освещающий лишь одну сферу деятельности и не могут быть распространены на прочие. \nУстановлено, что количество вакансий касающихся data science составляет около 3 процентов от общего числа имеющихся вакансий. \nОднако само по себе это не говорит о дефиците или переизбытке трудовых ресурсов в сфере data science. При этом доступных \nдля начинающих лишь 51 вакансия, что, несомненно крайне ограничивает их вхождение в этот сегмент трудового рынка.\nКак выяснилось, для data scientists знание SQL или postgres не является сколько-нибудь определяющим поскольку присутствует лишь в 13% доступных\nдля data scientists вакансий. Для всех прочих вакансий эти навыки не являются ключевыми. \nПолученные результаты касательно владения Python как ключевым навыком показывают, что он востребован в качестве такового лишь \nв 20% имеющихся вакансий. \nДанные о среднем количестве ключевых навыков, будучи избыточными и безотносительными не применимы для понимания трудового рынка.\nАнализ средней заработной платы в зависимости от опыта работы весьма полезен для нахождения баланса между желаемым и действительным и как\nтаковой имеет существенное практическое значение для всех сторон трудовых отношений.\n'

# Общий вывод по проекту

In [1086]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
'''
Исследование является фрагментарным и не может претендовать на сколько-нибудь широкий охват. Тем не менее, оно проливает свет на некоторые аспекты
экономической и трудовой деятельности и позволяет соориентировать в одном из ответвлений в таком сегменте деятельности как IT. 

В дополнение к проведённым исследованиям представляется разумным провести ещё следующие:
    Установить количество вакансий по сферам деятельности.
    Установить средний размер заработной платы по сферам деятельности.
    
Было бы неплохо отследить динамику вакансий по сферам деятельности, что позволило бы сделать стратегические прогнозы и предположения о
состоянии экономики в целом и тенденциях развития. Для этого необходимо делать временной срез по вакансиям, что на базе имеющихся данных
невозможно.
'''

'\nИсследование является фрагментарным и не может претендовать на сколько-нибудь широкий охват. Тем не менее, оно проливает свет на некоторые аспекты\nэкономической и трудовой деятельности и позволяет соориентировать в одном из ответвлений в таком сегменте деятельности как IT. \n\nВ дополнение к проведённым исследованиям представляется разумным провести ещё следующие:\n    Установить количество вакансий по сферам деятельности.\n    Установить средний размер заработной платы по сферам деятельности.\n    \nБыло бы неплохо отследить динамику вакансий по сферам деятельности, что позволило бы сделать стратегические прогнозы и предположения о\nсостоянии экономики в целом и тенденциях развития. Для этого необходимо делать временной срез по вакансиям, что на базе имеющихся данных\nневозможно.\n'

In [1087]:
# Определение количества вакансий по сферам деятельности
q1 = f'''
    select
        i.name,
        count(v.id)
    from
        EMPLOYERS_INDUSTRIES ei
        left join employers e on e.id = ei.employer_id
        left join vacancies v on v.employer_id = e.id
        left join industries i on i.id = ei.industry_id
        group by 1
    order by 2 desc
'''

df = pd.read_sql_query(q1, connection)
df.head(15)

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2011169005.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q1, connection)

                                                 name  count
0                 Разработка программного обеспечения  12499
1   Системная интеграция,  автоматизации технологи...  11034
2   Интернет-компания (поисковики, платежные систе...   6413
3                                                Банк   2742
4                                     Мобильная связь   1585
5                                  Кадровые агентства   1143
6                               Консалтинговые услуги   1137
7                                  Интернет-провайдер   1095
8                        Розничная сеть (продуктовая)   1034
9                                 Фиксированная связь   1028
10                               Оптоволоконная связь   1012
11  Маркетинговые, рекламные, BTL, дизайнерские, E...   1001
12                                   Интернет-магазин    788
13  Электронно-вычислительная, оптическая, контрол...    622
14  Электронно-вычислительная, оптическая, контрол...    584

#### Вывод по запросу о количестве вакансий по сферам деятельности
Определение количества вакансий по сферам деятельности показало, что подавляющее число вакансий исходит из сфер деятельности, связанных или имеющих отношение к IT, что с приводит к заключению о возможной стагнации промышленности.

In [1088]:
# Определение среднего размера заработной платы по сферам деятельности

q2 = f'''
        SELECT
            i.name,
            count(v.id) vacancies,
            round(AVG(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) wage
        FROM 
            EMPLOYERS_INDUSTRIES ei
            left join employers e on e.id = ei.employer_id
            left join vacancies v on v.employer_id = e.id
            left join industries i on i.id = ei.industry_id 
        WHERE 
            (salary_from IS not NULL or salary_to IS not NULL)
        GROUP BY 1
        order by 3 desc
'''

df = pd.read_sql_query(q2, connection)
df

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/347106296.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q2, connection)

                                          name  vacancies      wage
0    Агрохимия (продвижение, оптовая торговля)         14  381429.0
1                     Агрохимия (производство)         16  339875.0
2                               Игорный бизнес         20  191905.0
3            Корма для животных (производство)         29  168300.0
4                                   Зоомагазин         31  167613.0
..                                         ...        ...       ...
286                        Фото- и видеоуслуги         14   40961.0
287                          Ритуальные услуги          1   37401.0
288        Архив, библиотека, искусствоведение          9   36858.0
289                           Переработка газа          2   34068.0
290             Детское питание (производство)          9   32868.0

[291 rows x 3 columns]

#### Вывод по запросу об определении среднего размера заработной платы по сферам деятельности
Как видно, наибольший средний размер заработной платы в сфере агрохимии. Обращает на себя внимание, что количество вакансий в этой сфере деятельности не соответствует количеству вакансий, опредeлённых в предыдущем запросе. Чтобы внести ясность в этот вопрос, составим отдельный запрос ниже.

In [1089]:
q1 = f'''
    select
        salary_from,
        salary_to
    from
        EMPLOYERS_INDUSTRIES ei
        left join employers e on e.id = ei.employer_id
        left join vacancies v on v.employer_id = e.id
        left join industries i on i.id = ei.industry_id
        where i.name ilike 'Агрох%'
    order by 1, 2 asc
'''

df = pd.read_sql_query(q1, connection)
print('количество вакансий по агрохимии -', df.shape[0])
df.head(50)

/var/folders/ds/pylxck917yl36y11xbhgmxn80000gn/T/ipykernel_4537/2584425209.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(q1, connection)

количество вакансий по агрохимии - 107

    salary_from  salary_to
0       30000.0        NaN
1       30000.0        NaN
2       40000.0    80000.0
3       50000.0        NaN
4       60000.0        NaN
5       60000.0        NaN
6       88000.0        NaN
7      150000.0        NaN
8      150000.0        NaN
9      500000.0        NaN
10     500000.0        NaN
11     500000.0        NaN
12     500000.0        NaN
13     500000.0        NaN
14     500000.0        NaN
15     500000.0        NaN
16     500000.0        NaN
17     500000.0        NaN
18     500000.0        NaN
19     500000.0        NaN
20     500000.0        NaN
21     500000.0        NaN
22     500000.0        NaN
23     500000.0        NaN
24     500000.0        NaN
25     500000.0        NaN
26     500000.0        NaN
27     500000.0        NaN
28     500000.0        NaN
29          NaN   100000.0
30          NaN        NaN
31          NaN        NaN
32          NaN        NaN
33          NaN        NaN
34          NaN        NaN
35          NaN        NaN
36          NaN        NaN
37          NaN        NaN
38          NaN        NaN
39          NaN        NaN
40          NaN        NaN
41          NaN        NaN
42          NaN        NaN
43          NaN        NaN
44          NaN        NaN
45          NaN        NaN
46          NaN        NaN
47          NaN        NaN
48          NaN        NaN
49          NaN        NaN

### Вывод по текущему запросу
Расхождение к количестве вакансий во двум предыдущим запросом связано с тем, что в запросе о средней заработной плате не учитывались данные, где размер заработной платы не указан.

In [1090]:
connection.close()